# WorksetCreatedForLinkWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..WorksetCreatedForLinkWarning Property
BuiltInFailures..::..ImportFailures Class See Also
---
Newly created link types and instances were placed in new workset [workset name]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WorksetCreatedForLinkWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WorksetCreatedForLinkWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WorksetCreatedForLinkWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace